# GetEnumerator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceSet..::..GetEnumerator Method
SpaceSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator
```

Visual C++
---
```text
public:
virtual IEnumerator^ GetEnumerator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# ### Implements
IEnumerable..::..GetEnumerator()()()()
# See Also
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace